In [1]:
import sqlite3

In [2]:
# Connect to an sqlite database
connection = sqlite3.connect('example.db')
connection

In [3]:
cursor = connection.cursor()

In [5]:
#Create a Table
cursor.execute(''' 
Create Table If Not Exists employees(
    id Integer Primary Key,
    name Text Not Null,
    age Integer,
    department text
    )   
''')
#Commit the changes
connection.commit()

In [7]:
cursor.execute(''' 
Select * from employees   
''')

In [9]:
#Insert the data
cursor.execute('''
Insert Into employees(name,age,department)
                values('Darpan Giri',20,'Engineering')               
               
               ''')
cursor.execute('''
Insert Into employees(name,age,department)
                values('Krish Naik',32,'Data Scientist')                              
               ''')
cursor.execute('''
Insert Into employees(name,age,department)
values('Bob',32,'Web Developer')                              
               ''')
connection.commit()

In [10]:
##Query the data from table
cursor.execute('Select * from employees')
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Darpan Giri', 20, 'Engineering')
(2, 'Krish Naik', 32, 'Data Scientist')
(3, 'Bob', 32, 'Web Developer')
(4, 'Darpan Giri', 20, 'Engineering')
(5, 'Krish Naik', 32, 'Data Scientist')
(6, 'Bob', 32, 'Web Developer')

In [12]:
#Update the data in a table
cursor.execute('''
UPDATE employees
Set age =34
where name='Krish Naik'              
               ''')
connection.commit()

In [13]:
cursor.execute('Select * from employees')
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Darpan Giri', 20, 'Engineering')
(2, 'Krish Naik', 34, 'Data Scientist')
(3, 'Bob', 32, 'Web Developer')
(4, 'Darpan Giri', 20, 'Engineering')
(5, 'Krish Naik', 34, 'Data Scientist')
(6, 'Bob', 32, 'Web Developer')

In [14]:
cursor.execute('''
Delete from employees 
                where name='Bob'              
               ''')
connection.commit()

In [15]:
cursor.execute('Select * from employees')
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Darpan Giri', 20, 'Engineering')
(2, 'Krish Naik', 34, 'Data Scientist')
(4, 'Darpan Giri', 20, 'Engineering')
(5, 'Krish Naik', 34, 'Data Scientist')

In [25]:
connection = sqlite3.connect('sales_data.db')
cursor = connection.cursor()
cursor.execute('''
CREATE TABLE IF NOT EXISTS sales(
    id INTEGER PRIMARY KEY,
    date TEXT NOT NULL,
    product TEXT NOT NULL,
    sales INTEGER,
    region TEXT
)                             
               ''')
#Insert data into sales table
sales_data = [
    ('2023-01-01',"Product 1",100,"North"),
    ('2023-01-02',"Product 2",200,"South"),
    ('2023-01-03',"Product 1",150,"East"),
    ('2023-01-04',"Product 3",250,"West"),
    ('2023-01-05',"Product 2",300,"North")
]

cursor.executemany('''
Insert into sales(date,product,sales,region)
VALUES(?,?,?,?)
''',sales_data 
)

connection.commit()

OperationalError: table sales has no column named date

In [28]:
import sqlite3

connection = sqlite3.connect('sales_data.db')
cursor = connection.cursor()

# Remove old table
cursor.execute("DROP TABLE IF EXISTS sales")

cursor.execute('''
CREATE TABLE IF NOT EXISTS sales(
    id INTEGER PRIMARY KEY,
    date TEXT NOT NULL,
    product TEXT NOT NULL,
    sales INTEGER,
    region TEXT
)
''')

# Insert data
sales_data = [
    ('2023-01-01', "Product 1", 100, "North"),
    ('2023-01-02', "Product 2", 200, "South"),
    ('2023-01-03', "Product 1", 150, "East"),
    ('2023-01-04', "Product 3", 250, "West"),
    ('2023-01-05', "Product 2", 300, "North")
]

cursor.executemany('''
INSERT INTO sales(date, product, sales, region)
VALUES (?, ?, ?, ?)
''', sales_data)

connection.commit()

In [30]:
cursor.execute('Select * from sales')
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, '2023-01-01', 'Product 1', 100, 'North')
(2, '2023-01-02', 'Product 2', 200, 'South')
(3, '2023-01-03', 'Product 1', 150, 'East')
(4, '2023-01-04', 'Product 3', 250, 'West')
(5, '2023-01-05', 'Product 2', 300, 'North')

In [31]:
connection.close()